In [2]:
import pandas as pd

s = pd.Series([10, 20, 30, 40, 50, 60, 70, 80, 90])

print(s) #cria umna coluna com o "series"

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [3]:
df = pd.DataFrame({
    "Nome":["Ana", "Bruno", "Danilo","Maicon","Luan"],
    "Idade":[25, 30, 21, 33, 28]
})
print(df) #Cria uma tabela com o "dataframe"

     Nome  Idade
0     Ana     25
1   Bruno     30
2  Danilo     21
3  Maicon     33
4    Luan     28

In [5]:
df.head(2) #Busca os primeiros nomes (segundo o numero que o usuário quiser coolocar)

    Nome  Idade
0    Ana     25
1  Bruno     30

In [6]:
df.tail(2) #Busca os últimos nomes (segundo o numero que o usuário quiser coolocar)

     Nome  Idade
3  Maicon     33
4    Luan     28

In [8]:
print(df["Nome"]) #Retorna apenas a coluna Nome

0       Ana
1     Bruno
2    Danilo
3    Maicon
4      Luan
Name: Nome, dtype: object